; domain
(define (domain valueflows)


(:requirements :strips :typing :adl )

(:types 
    thing
    role
    resource - thing 
    actor - thing 
    recipeResource - thing
    vehicle - resource
    truck - vehicle
    car - vehicle
    resourceClass
    location
    action
    recipeFlow
    recipeProcess
    recipeLocation 
)

; un-comment following line if constants are needed
(:constants 
    transfer move goto transfer-all-rights transfer-custody mount dismount put-into take-out-of begin-use end-use use - action
    null - thing


    ; wikidataTransport - resourceClass
    ; rConsignment - recipeResource
    ; rVehicle - recipeResource
    ; rTransporter - role
    ; rContractee - role
    ; rMoveConsignment - recipeFlow
    ; rUseVehicle - recipeFlow
    ; rFromLocation - recipeLocation
    ; rToLocation - recipeLocation 
    ; (recipeFlow rMoveConsignment move rTransporter rContractee rConsignment rFromLocation rTolocation)
    ; (recipeFlow rMoveVehicle move rTransporter rContractee rVehicle rFromLocation rTolocation)
    ; (recipeFlow rUseVehicleAtFromLocation use rTransporter rTransporter rVehicle rFromLocation)
    ; (recipeFlow rUseVehicleAtToLocation use rTransporter rTransporter rVehicle rToLocation)
    ; (recipeFlow rDeliverTransportService deliver-service rTransporter rContractee wikidataTransport)
    ; (recipeInputOf rTransport rMoveVehicle )
    ; (recipeInputOf rTransport rUseVehicleAtFromLocation )
    ; (recipeOutputOf rTransport rUseVehicleAtToLocation )
    ; (recipeOutputOf rTransport rMoveConsignment )
    ; (recipeResultOf rTransport rDeliverTransportService)
)

(:predicates 
    (currentLocation ?t - thing ?l - location) ; t is at location l
    (resourceClassification ?r - resource ?c - resourceClass )
    (custodian ?r - resource ?a - actor ) ; a is currently in custody of r
    (primaryAccountable ?r - resource ?a - actor) ; a is the owner of r
    (intent ?action - action ?provider ?receiver - actor ?r - resource ?l - location)
    (commitment ?action - action ?provider ?receiver - actor ?r - resource ?l - location)
    (using ?a - actor ?r - resource) ; a is using r
    (isCarryable ?r - resource) ; an actor can move the resource
    (isVehicle ?r - resource) ; r is a vehicle
    (isPassive ?a - actor) ; actor cannot be in the provider/receiver role
    (mayContainResources ?r - resource) ; a truck, for example
    (mayContainActors ?a - actor) ; a means of person transport
    (containedIn ?rinside - thing ?rcontainer - resource) ; rinside is inside rcontainer
   ; (recipeFlow ?action - action ?provider - actor ?receiver - actor ?r - recipeResource)
)


;(:functions (total-cost))

(:action commit 
    :parameters (?action - action ?provider ?receiver - actor ?resource - resource ?location - location)
    :precondition 
        (or 
            (intent ?action ?provider ?receiver ?resource ?location)
            (intent ?action ?provider ?receiver ?resource null)
            (and
                (intent ?action ?provider null ?resource ?location)
                (intent ?action null ?receiver ?resource ?location)
            )
            (and
                (intent ?action ?provider ?receiver ?resource null)
                (intent ?action ?provider ?receiver ?resource null)
            )
            (and
                (intent ?action ?provider ?receiver null ?location)
                (intent ?action ?provider ?receiver null ?location)
            )
            (and
                (intent ?action ?provider null ?resource ?location)
                (intent ?action null ?receiver ?resource ?location)
            )
            (and
                (intent ?action ?provider null ?resource null)
                (intent ?action null ?receiver null ?location)
            )
            (and
                (intent ?action ?provider null null ?location)
                (intent ?action null ?receiver ?resource null)
            )
            (and
                (intent ?action ?provider null ?resource null)
                (intent ?action null ?receiver null null)
            )
            (and
                (intent ?action ?provider null ?resource ?location)
                (intent ?action null ?receiver ?resource null)
            )
            (and
                (intent ?action ?provider null ?resource null)
                (intent ?action null ?receiver ?resource ?location)
            )
            (and
                (intent ?action ?provider null null null)
                (intent ?action null ?receiver ?resource ?location)
            )
            (and
                (intent ?action null ?receiver null null)
                (intent ?action ?provider null ?resource ?location)
            )
        )
    :effect 
        (commitment ?action ?provider ?receiver ?resource ?location)
)

(:action move 
    :parameters (?a - actor ?r - resource ?fromLocation ?toLocation - location)
    :precondition ( and
        (not (isPassive ?a))
        (currentLocation ?r ?fromLocation)
        (currentLocation ?a ?fromLocation)
        (custodian ?r ?a)
        (commitment move ?a ?a ?r ?toLocation)
        (or
            (isCarryable ?r) ; actor carries it
            (and 
                (isVehicle ?r) ; actor drives it
                (using ?a ?r) ; actor uses it
            )
        )
    )
    :effect ( and
        (not (currentLocation ?r ?fromLocation))
        (not (currentLocation ?a ?fromLocation))
        (currentLocation ?r ?toLocation)
        (currentLocation ?a ?toLocation)
        (forall (?t - thing )
            (when 
                (containedIn ?t ?r)
                (and 
                    (currentLocation ?t ?toLocation)
                    (not (currentLocation ?t ?fromLocation))
                )
            )
        )
    )
)

(:action put-into
    :parameters (?a - actor ?r ?rContainer - resource)
    :precondition (and 
        (not (isPassive ?a))
        (custodian ?r ?a)
        (custodian ?rcontainer ?a)
        (mayContainResources ?rContainer)
        (exists (?l - location ) 
            (and
                (currentLocation ?r ?l)
                (currentLocation ?rContainer ?l)
            )
        )
        (not (exists (?otherContainer - resource) (containedIn ?r ?rContainer)))
    )
    :effect (and 
        (containedIn ?r ?rContainer)
    )
)


(:action take-out-of
    :parameters (?a - actor ?r ?rContainer - resource)
    :precondition (and
        (not (isPassive ?a))
        (containedIn ?r ?rContainer)
        (custodian ?rcontainer ?a)
    )
    :effect 
        (and
            (not (containedIn ?r ?rContainer))
        )
)


(:action mount
    :parameters (?driver ?passenger - actor ?vehicle - resource ?l - location)
    :precondition (and 
        (isVehicle ?vehicle)
        (not (isPassive ?driver))
        (not (isPassive ?passenger))
        (using ?driver ?vehicle)
        (mayContainActors ?vehicle)
        (commitment mount ?driver ?passenger ?vehicle ?l)            
        (currentLocation ?driver ?l)
        (currentLocation ?vehicle ?l)
        (currentLocation ?passenger ?l)
        (not (exists (?otherContainer - resource) (containedIn ?passenger ?vehicle)))
        (not 
            (exists (?res - resource )
                (and  
                    (custodian ?res ?passenger)
                    (not (isCarryable ?res))
                )
            )
        )
    )
    :effect (and 
        (containedIn ?passenger ?vehicle)
        (isPassive ?passenger)
    )
)

(:action dismount
    :parameters (?driver ?passenger - actor ?vehicle - resource ?l - location)
    :precondition (and 
        (isVehicle ?vehicle)
        (not (isPassive ?driver))
        (custodian ?vehicle ?driver)
        (containedIn ?passenger ?vehicle)
        (commitment dismount ?driver ?passenger ?vehicle ?l)
    )
    :effect 
        (and
            (not (containedIn ?passenger ?vehicle))
            (not (isPassive ?passenger))
        )
)

(:action begin-use
    :parameters (?a - actor ?r - resource)
    :precondition ( and
        (exists (?l - location) 
            (and
                (currentLocation ?r ?l)
                (currentLocation ?a ?l)
                (commitment use ?a ?a ?r ?l)
            )
        )
        (not (isPassive ?a))
        (custodian ?r ?a)
        (not (exists(?a2 - actor) (using ?a2 ?r)))
    )
    :effect (using ?a ?r)
)


(:action end-use
    :parameters (?a - actor ?r - resource)
    :precondition 
        (and 
            (using ?a ?r)
            (not (isPassive ?a))
        )
    :effect 
        (and
            (not(using ?a ?r))
        )
)

(:action transfer-custody
    :parameters (?provider ?receiver - actor ?r - resource ?l - location)
    :precondition (and
        (not (isPassive ?provider))
        (not (isPassive ?receiver))
        (custodian ?r ?provider)
        (not (= ?provider ?receiver))
        (currentLocation ?provider ?l) 
        (currentLocation ?receiver ?l)
        (currentLocation ?r ?l)
        (commitment transfer-custody ?provider ?receiver ?r ?l) 
        (not (exists (?container - resource) (containedIn ?r ?container)))
    )
    :effect(and
        (not (custodian ?r ?provider))
        (custodian ?r ?receiver)
    )
)

(:action transfer-all-rights
    :parameters (?provider ?receiver - actor ?r - resource ?l - location)
    :precondition 
        ( and 
            (primaryAccountable ?r ?provider)
            (not (isPassive ?provider))
            (not (isPassive ?receiver)) ;questionable
            (currentLocation ?provider ?l)
            (commitment transfer-all-rights ?provider ?receiver ?r ?l) 
        )
    :effect 
        ( and
            (not(primaryAccountable ?r ?provider))
            (primaryAccountable ?r ?receiver)
        )
)

(:action transfer
    :parameters (?provider - actor ?receiver - actor ?r - resource ?l - location)
    :precondition 
        ( and 
            (not (isPassive ?provider))
            (not (isPassive ?receiver))
            (custodian ?r ?provider)
            (primaryAccountable ?r ?provider)
            (currentLocation ?provider ?l) 
            (currentLocation ?receiver ?l)
            (currentLocation ?r ?l)
            (commitment transfer ?provider ?receiver ?r ?l) 
            (not (exists (?container - resource) (containedIn ?r ?container)))
        )
    :effect 
        ( and
            (not(primaryAccountable ?r ?provider))
            (not (custodian ?r ?provider))
            (primaryAccountable ?r ?receiver)
            (custodian ?r ?receiver)            
        )
)

)

; problem
(define 
    (problem simple-move) 
    (:domain valueflows)
(:objects 
    Apples - resource
    Rossatz Krems Wien Gedersdorf - location
    Alice Bob Claudia Rolf Maria - actor
    GrannySmith - resourceClass
    Truck1 - truck
    Car1 - car 
)

(:init
    
    (currentLocation Apples Rossatz)
    (currentLocation Alice Rossatz)
    (resourceClassification Apples GrannySmith)
    (custodian Apples Alice)
    (primaryAccountable Apples Alice)    
    (intent transfer-all-rights Alice null Apples Rossatz)
    (intent transfer-custody Alice null Apples Rossatz)
    
    (currentLocation Bob Wien)
    (intent transfer-all-rights null Bob Apples null)
    (intent transfer-custody null Bob Apples Wien)

    (currentLocation Truck1 Gedersdorf)
    (custodian Truck1 Rolf)
    (isVehicle Truck1)
    (mayContainResources Truck1)
    (currentLocation Rolf Gedersdorf)
    (intent transfer-custody Rolf null Truck1 Gedersdorf)
    (intent transfer-custody null Rolf Truck1 Gedersdorf) ;might be too weak - should get the truck back from same actor

    (currentLocation Maria Krems)
    (custodian Car1 Maria)
    (mayContainActors Car1)
    (isVehicle Car1)
    (currentLocation Car1 Krems)
    (intent use Maria Maria Car1 null)
    (intent move Maria Maria Car1 null)
    (intent mount Maria null Car1 null)
    (intent dismount Maria null Car1 null)

    (currentlocation Claudia Krems)    
    (intent transfer-custody null Claudia Truck1 null); too strong! Truck1 should be ?truck - truck
    (intent transfer-custody Claudia null Truck1 null)
    (intent use Claudia Claudia Truck1 null)
    (intent move Claudia Claudia Truck1 null)
    (intent mount null Claudia null Krems)
    (intent dismount null Claudia null Gedersdorf)
    (intent mount null Claudia null Gedersdorf)
    (intent dismount null Claudia null Krems)
    (intent transfer-custody null Claudia null null)
    (intent transfer-custody Claudia null null null)

    
)

(:goal 
    (and
        (custodian Apples Bob)
        (primaryAccountable Apples Bob)
       ; (custodian Truck1 Rolf)
       ; (currentLocation Maria Krems)
       ; (currentLocation Claudia Krems)
    )
)

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (commit mount maria claudia car1 krems)
   added: (commitment mount maria claudia car1 krems)
   goals met: 0 of 2
2. (commit move claudia claudia truck1 rossatz)
   added: (commitment move claudia claudia truck1 rossatz)
   goals met: 0 of 2
3. (commit move claudia claudia truck1 wien)
   added: (commitment move claudia claudia truck1 wien)
   goals met: 0 of 2
4. (commit move maria maria car1 gedersdorf)
   added: (commitment move maria maria car1 gedersdorf)
   goals met: 0 of 2
5. (commit move maria maria car1 rossatz)
   added: (commitment move maria maria car1 rossatz)
   goals met: 0 of 2
6. (commit transfer-all-rights alice bob apples rossatz)
   added: (commitment transfer-all-rights alice bob apples rossatz)
   goals met: 0 of 2
7. (commit transfer-custody alice claudia apples rossatz)
   added: (commitment transfer-custody alice claudia apples rossatz)
   goals met: 0 of 2
8. (commit transfer-custody claudia bob apples wien)
   added: (commitment transfer-custody claudia bob apples wien)
   goals met: 0 of 2
9. (commit transfer-custody rolf claudia truck1 gedersdorf)
   added: (commitment transfer-custody rolf claudia truck1 gedersdorf)
   goals met: 0 of 2
10. (commit use claudia claudia truck1 gedersdorf)
   added: (commitment use claudia claudia truck1 gedersdorf)
   goals met: 0 of 2
11. (commit use maria maria car1 krems)
   added: (commitment use maria maria car1 krems)
   goals met: 0 of 2
12. (begin-use maria car1)
   added: (using maria car1)
   goals met: 0 of 2
13. (commit dismount maria claudia car1 gedersdorf)
   added: (commitment dismount maria claudia car1 gedersdorf)
   goals met: 0 of 2
14. (mount maria claudia car1 krems)
   added: (containedin claudia car1) (ispassive claudia)
   goals met: 0 of 2
15. (move maria car1 krems gedersdorf)
   deleted: (currentlocation car1 krems) (currentlocation maria krems) (currentlocation claudia krems)
   added: (currentlocation car1 gedersdorf) (currentlocation maria gedersdorf) (currentlocation claudia gedersdorf)
   goals met: 0 of 2
16. (dismount maria claudia car1 gedersdorf)
   deleted: (containedin claudia car1) (ispassive claudia)
   goals met: 0 of 2
17. (transfer-custody rolf claudia truck1 gedersdorf)
   deleted: (custodian truck1 rolf)
   added: (custodian truck1 claudia)
   goals met: 0 of 2
18. (begin-use claudia truck1)
   added: (using claudia truck1)
   goals met: 0 of 2
19. (transfer-all-rights alice bob apples rossatz)
   deleted: (primaryaccountable apples alice)
   added: (primaryaccountable apples bob)
   goals met: 1 of 2
20. (move claudia truck1 gedersdorf rossatz)
   deleted: (currentlocation truck1 gedersdorf) (currentlocation claudia gedersdorf)
   added: (currentlocation truck1 rossatz) (currentlocation claudia rossatz)
   goals met: 1 of 2
21. (transfer-custody alice claudia apples rossatz)
   deleted: (custodian apples alice)
   added: (custodian apples claudia)
   goals met: 1 of 2
22. (put-into claudia apples truck1)
   added: (containedin apples truck1)
   goals met: 1 of 2
23. (move claudia truck1 rossatz wien)
   deleted: (currentlocation truck1 rossatz) (currentlocation claudia rossatz) (currentlocation apples rossatz)
   added: (currentlocation truck1 wien) (currentlocation claudia wien) (currentlocation apples wien)
   goals met: 1 of 2
24. (take-out-of claudia apples truck1)
   deleted: (containedin apples truck1)
   goals met: 1 of 2
25. (transfer-custody claudia bob apples wien)
   deleted: (custodian apples claudia)
   added: (custodian apples bob)
   goals met: 2 of 2
